{
  "list": [
    {
      "id": 21,
      "name": "Aqua Morty",
      "about": "Aqua Morty is a Morty variation that possesses aquatic features. He is shown as having gills and webbed hands, indicating his adaptation to underwater environments. Aqua Morty is featured in the episode 'The Ricklantis Mixup,' where he is seen in the Citadel of Ricks. This version of Morty demonstrates the endless possibilities for Morty's existence across dimensions."
    },
    {
      "id": 22,
      "name": "Aqua Rick",
      "about": "Aqua Rick is a version of Rick Sanchez with aquatic attributes. He is shown to have gills and webbed hands, indicating his adaptation to underwater environments. Aqua Rick appears in the episode 'The Ricklantis Mixup,' where he resides in the Citadel of Ricks. This variation of Rick showcases the vast range of possibilities within the show's multiverse."
    },
    {
      "id": 23,
      "name": "Arcade Alien",
      "about": "Arcade Alien is a character that can be seen in the interdimensional arcade called 'Blips and Chitz.' He is an alien creature with multiple limbs and eyes, resembling a cross between an insect and a humanoid. Arcade Alien is often seen engrossed in playing various video games in the background of scenes, adding to the detailed and diverse world of Rick and Morty."
    },
    {
      "id": 24,
      "name": "Armagheadon",
      "about": "Armagheadon is a character introduced in the episode 'The Rickshank Rickdemption.' He is a giant, telepathic arm that possesses immense power and intelligence. Armagheadon is depicted as a member of the 'Cromulons,' a race of giant heads who organize the intergalactic music competition known as 'Festival Supreme.' This unique character adds to the show's imaginative and bizarre universe."
    },
    {
      "id": 25,
      "name": "Armothy",
      "about": "Armothy is a character that appears in the episode 'Rest and Ricklaxation.' He is a sentient arm created by Rick to serve as a weapon but gains consciousness and seeks to live a peaceful life. Armothy's storyline explores themes of identity and purpose while offering a darkly comedic take on the concept of a living limb. His character embodies the show's blend of sci-fi and humor."
    },
    {
      "id": 26,
      "name": "Arthricia",
      "about": "Arthricia is an alien character introduced in the episode 'Rixty Minutes.' She hails from the planet Gazorpazorp and joins Morty on an adventure. Arthricia is a strong-willed and independent character who challenges traditional gender roles and expectations. Her inclusion in the show highlights its progressive themes and willingness to explore social commentary through its characters."
    },
    {
      "id": 27,
      "name": "Artist Morty",
      "about": "Artist Morty is a Morty variation who possesses artistic abilities. He appears in the episode 'Get Schwifty,' where he is seen painting a mural inspired by the giant Cromulon head that arrives on Earth. Artist Morty's inclusion showcases the show's knack for creating diverse Morty counterparts with unique talents and characteristics."
    },
    {
      "id": 28,
      "name": "Attila Starwar",
      "about": "Attila Starwar is a character mentioned in the episode 'Something Ricked This Way Comes.' Although not shown on screen, his name is displayed on a list of potential customers for the 'Needful Things' store. Attila Starwar's name is a playful nod to historical figure Attila the Hun and the Star Wars franchise, blending references in typical Rick and Morty fashion."
    },
    {
      "id": 29,
      "name": "Baby Legs",
      "about": "Baby Legs is a character who appears in the episode 'Ricksy Business.' He is a detective in a film noir-inspired dimension where individuals have a regular-sized upper body and tiny baby-sized legs. Baby Legs teams up with Morty and Summer to solve a murder mystery, adding a touch of noir and absurdity to the show's eclectic mix of genres."
    },
    {
      "id": 30,
      "name": "Baby Poopybutthole",
      "about": "Baby Poopybutthole is a character introduced in the post-credit scene of the episode 'Ricksy Business.' He is depicted as a baby version of Mr. Poopybutthole, a long-time recurring character in the show. Baby Poopybutthole's appearance serves as a humorous twist and a clever way to extend the character's presence while playing with the concept of time and aging in the show's universe."
    },
    {
      "id": 31,
      "name": "Baby Wizard",
      "about": "In the episode 'Raising Gazorpazorp' of Rick and Morty, Baby Wizard makes a brief appearance. Interestingly, Baby Wizard is voiced by Stephen Colbert, the famous American comedian and television host. Colbert's distinctive voice adds a unique charm to the character, making Baby Wizard even more memorable."
    },
    {
      "id": 32,
      "name": "Bearded Lady",
      "about": "The character Bearded Lady in Rick and Morty is a reference to the famous sideshow attraction commonly found in circuses. In real-life history, bearded ladies were women who had a genetic condition called hypertrichosis, which caused abnormal hair growth. The inclusion of Bearded Lady in the show highlights Rick and Morty's penchant for blending fantastical elements with pop culture references."
    },
    {
      "id": 33,
      "name": "Beebo",
      "about": "Beebo, the character from Rick and Morty, bears a striking resemblance to a popular fictional character from the Arrowverse DC TV series. In the Arrowverse, Beebo is a time-traveling, talking blue stuffed animal that gained massive popularity among fans. The reference in Rick and Morty is a playful nod to the cultural impact of Beebo in the superhero genre."
    },
    {
      "id": 34,
      "name": "Benjamin",
      "about": "Benjamin, the talking telepathic tiger from Rick and Morty, is voiced by the renowned actor and writer, Dan Harmon. Harmon is one of the co-creators of Rick and Morty and also lends his voice to various other characters in the series. Benjamin's inclusion showcases the show's knack for introducing eccentric and memorable characters, adding to the overall absurdity of the Rick and Morty universe."
    },
    {
      "id": 35,
      "name": "Bepisian",
      "about": "The Bepisians in Rick and Morty are a fictional alien species known for their fondness for Bepis, a playful reference to the real-world brand, Pepsi. The name 'Bepis' is a humorous take on the occasional mispronunciation of 'Pepsi' as 'Bepis' in certain languages or contexts. The inclusion of Bepisians adds a touch of parody and satire to the show's exploration of interdimensional cultures."
    },
    {
      "id": 36,
      "name": "Beta-Seven",
      "about": "Beta-Seven is a robotic character from Rick and Morty who serves as a robotic servant for Jerry Smith. The design and concept of Beta-Seven bear resemblance to various fictional robotic characters from popular science fiction, such as R2-D2 from Star Wars or Bender from Futurama. The inclusion of Beta-Seven showcases Rick and Morty's ability to pay homage to and satirize different sci-fi tropes."
    },
    {
      "id": 37,
      "name": "Beth Sanchez",
      "about": "Beth Sanchez, also known as Rick's daughter, is a complex character in Rick and Morty. She struggles with her identity and often questions her choices and relationships. Beth's character arc explores themes of existentialism and the nature of personal fulfillment. Her multidimensional personality adds depth to the show and serves as a catalyst for various storylines within the series."
    },
    {
      "id": 38,
      "name": "Beth Smith",
      "about": "Beth Smith, Morty's mother and Jerry's wife, goes through significant character development throughout the series Rick and Morty. One interesting aspect is the existence of an alternate version of Beth, commonly referred to as 'Clone Beth' or 'Beth Clone.' The ambiguity surrounding whether Beth is a clone or the original adds a layer of mystery and philosophical contemplation to her character."
    },
    {
      "id": 39,
      "name": "Beth Smith",
      "about": "Beth Smith, Morty's mother and Jerry's wife, is a complex character in Rick and Morty. Her tumultuous relationship with Rick, her father, often serves as a focal point for the show's narrative. Beth's character is a constant exploration of the complexities of familial bonds and the impact of extraordinary circumstances on personal growth and self-discovery."
    },
    {
      "id": 40,
      "name": "Beth's Mytholog",
      "about": "In the episode 'Close Rick-counters of the Rick Kind' of Rick and Morty, Beth's Mytholog is introduced. Beth's Mytholog represents her perception of herself and her desires, as well as the influence of her father, Rick. The concept of Mythologs in the show explores the idea of self-awareness and the internalization of external expectations, adding psychological depth to the characters."
    }
  ]
}
