{
  "list": [
    {
      "id": 501,
      "name": "Fascist Rick’s Clone",
      "about": "Fascist Rick's Clone is an alternate version of Rick Sanchez who is a member of the Citadel of Ricks. The curious fact about Fascist Rick's Clone is that he is known for his distinctive mustache, which is a reference to the iconic mustache of Charlie Chaplin, a famous silent film actor. This serves as a satirical commentary on the character's fascist ideology, as Chaplin himself was known for his political activism and his opposition to fascism."
    },
    {
      "id": 502,
      "name": "Revolio Clockberg Jr.",
      "about": "Revolio Clockberg Jr., also known as Gearhead, is an inventor and a recurring character in Rick and Morty. The curious fact about Revolio Clockberg Jr. is that his character design is heavily inspired by the character Krang from the Teenage Mutant Ninja Turtles. Both characters have a similar appearance with a humanoid body and a face-like entity attached to their stomach. This homage to Krang adds a nostalgic touch for fans of the classic TMNT series."
    },
    {
      "id": 503,
      "name": "Fascist Shrimp Rick",
      "about": "Fascist Shrimp Rick is a version of Rick Sanchez who is a member of the fascist Shrimp universe. The curious fact about Fascist Shrimp Rick is that he is often seen holding a shrimp cocktail, which is a nod to the character's association with shrimps. This humorous detail emphasizes the absurdity of the character and serves as a visual representation of his affiliation with the shrimp-based society."
    },
    {
      "id": 504,
      "name": "Fascist Shrimp Rick’s Clone",
      "about": "Fascist Shrimp Rick's Clone, like the original Fascist Shrimp Rick, is associated with the shrimp-based society in the Rick and Morty multiverse. The curious fact about this clone is that he is often seen wearing a tiny monocle, symbolizing his intellectual persona and aristocratic demeanor. The monocle adds a touch of sophistication to the character and highlights the juxtaposition between the clone's refined appearance and the absurdity of the shrimp-themed universe."
    },
    {
      "id": 505,
      "name": "Fascist Shrimp Morty",
      "about": "Fascist Shrimp Morty is a version of Morty Smith from the fascist Shrimp universe. The curious fact about Fascist Shrimp Morty is that he has a small shrimp figurine attached to his backpack, which serves as a visual representation of his connection to the shrimp-based society. This detail showcases the attention to world-building in Rick and Morty and adds a humorous touch to the character's design."
    },
    {
      "id": 506,
      "name": "Fascist Shrimp SS",
      "about": "Fascist Shrimp SS is a member of the fascist Shrimp universe and serves as part of the Shrimp security force. The curious fact about Fascist Shrimp SS is that they wear miniature shrimp-shaped helmets, reminiscent of the iconic German Stahlhelm helmets used during World War II. This design choice adds a satirical element by merging the imagery of fascism with the absurdity of a shrimp-themed society, creating a unique visual representation."
    },
    {
      "id": 507,
      "name": "Fascist Teddy Bear Rick",
      "about": "Fascist Teddy Bear Rick is an alternate version of Rick Sanchez from the Citadel of Ricks who has taken on the appearance of a teddy bear. The curious fact about Fascist Teddy Bear Rick is that his character design is inspired by the Teddy Ruxpin toy, a popular animatronic teddy bear from the 1980s. This nostalgic reference adds a layer of irony to the character, as the cute and innocent appearance contrasts with the character's fascist ideology."
    },
    {
      "id": 508,
      "name": "Fascist Teddy Bear Rick’s Clone",
      "about": "Fascist Teddy Bear Rick's Clone is a clone of the Fascist Teddy Bear Rick from the Citadel of Ricks. The curious fact about this clone is that he is often seen carrying a miniature copy of Mein Kampf, Adolf Hitler's autobiographical manifesto. This detail serves as a dark and satirical reference to the character's fascist ideology, highlighting the extreme and twisted nature of the Rick and Morty multiverse."
    },
    {
      "id": 509,
      "name": "Bully",
      "about": "Bully is a character who appears in the episode 'The Ricks Must Be Crazy.' The curious fact about Bully is that his design is inspired by the bully character Scut Farkus from the classic holiday film 'A Christmas Story.' Both characters share a similar appearance, with a yellow-colored coat, a hat, and goggles. This homage adds a nostalgic touch to Bully's character and creates a recognizable reference for fans of both Rick and Morty and 'A Christmas Story.'"
    },
    {
      "id": 510,
      "name": "Anchorman",
      "about": "Anchorman is a character who appears in the episode 'The Wedding Squanchers.' The curious fact about Anchorman is that he is voiced by the popular actor and comedian Keith David. Keith David is known for his distinct deep voice and has lent his voice to various animated characters and video game roles. His voice acting adds a recognizable and authoritative presence to the character of Anchorman in Rick and Morty."
    },
    {
      "id": 511,
      "name": "Anchorwoman",
      "about": "Anchorwoman is a character who appears in the episode 'The Wedding Squanchers.' The curious fact about Anchorwoman is that she is voiced by Tara Strong, a prolific voice actress known for her work in various animated series and films. Tara Strong has voiced numerous iconic characters, such as Bubbles from 'The Powerpuff Girls' and Harley Quinn from 'Batman: The Animated Series.' Her talent and versatility bring a lively and engaging performance to the character of Anchorwoman in Rick and Morty."
    },
    {
      "id": 512,
      "name": "Morty’s Lawyer",
      "about": "Morty's Lawyer is a character who appears in the episode 'The Rickchurian Mortydate.' The curious fact about Morty's Lawyer is that he is a parody of the character Saul Goodman, a lawyer from the TV series 'Breaking Bad' and its spin-off 'Better Call Saul.' Morty's Lawyer shares a similar appearance and flamboyant personality with Saul Goodman, creating a humorous reference for fans of both shows and adding a touch of legal drama to the Rick and Morty universe."
    },
    {
      "id": 513,
      "name": "Judge",
      "about": "Judge is a character who appears in the episode 'The Rickchurian Mortydate.' The curious fact about Judge is that he is voiced by Maurice LaMarche, a well-known voice actor in the industry. Maurice LaMarche has provided voices for numerous animated characters, including The Brain in 'Pinky and the Brain' and various characters in 'Futurama.' His distinctive voice brings a sense of authority and gravitas to the character of Judge in Rick and Morty."
    },
    {
      "id": 514,
      "name": "Public Opinion Judge",
      "about": "Public Opinion Judge is a character who appears in the episode 'The Rickchurian Mortydate.' The curious fact about Public Opinion Judge is that he is a reference to the concept of public opinion and the role it plays in shaping legal decisions. Public Opinion Judge represents the fickle and unpredictable nature of public sentiment and its influence on the justice system. This character serves as a satirical commentary on the power of public perception in society."
    },
    {
      "id": 515,
      "name": "Caterpillar Mr. Goldenfold",
      "about": "Caterpillar Mr. Goldenfold is a version of Mr. Goldenfold who appears in the episode 'Close Rick-counters of the Rick Kind.' The curious fact about Caterpillar Mr. Goldenfold is that his design is inspired by the character Hookah-Smoking Caterpillar from Lewis Carroll's 'Alice's Adventures in Wonderland.' Both characters share a similar appearance, with a caterpillar-like body and a fondness for smoking. This whimsical reference adds an element of fantasy and surrealism to Caterpillar Mr. Goldenfold's character."
    },
    {
      "id": 516,
      "name": "Wasp Rick",
      "about": "Wasp Rick is an alternate version of Rick Sanchez who appears in the episode 'Rickmancing the Stone.' The curious fact about Wasp Rick is that his character design is influenced by the post-apocalyptic wasteland setting of the episode. He wears a makeshift wasp-themed armor and wields a wasp stinger as a weapon. This unique design reflects the survivalist nature of Wasp Rick and adds a distinctive visual element to his character."
    },
    {
      "id": 517,
      "name": "Wasp Rick’s Clone",
      "about": "Wasp Rick's Clone is a clone of Wasp Rick from the episode 'Rickmancing the Stone.' The curious fact about this clone is that he has a scar on his face, indicating a history of battles and survival in the post-apocalyptic wasteland. The scar adds a rugged and battle-hardened look to the character, emphasizing the harsh and dangerous environment of the Rick and Morty multiverse."
    },
    {
      "id": 518,
      "name": "Wasp Morty",
      "about": "Wasp Morty is an alternate version of Morty Smith who appears in the episode 'Rickmancing the Stone.' The curious fact about Wasp Morty is that he wears a wasp-themed helmet and carries a stinger as a weapon, similar to Wasp Rick. This design choice reflects the influence of Wasp Rick on Morty and showcases Morty's willingness to adapt and survive in the post-apocalyptic wasteland setting."
    },
    {
      "id": 519,
      "name": "Wasp Summer",
      "about": "Wasp Summer is an alternate version of Summer Smith who appears in the episode 'Rickmancing the Stone.' The curious fact about Wasp Summer is that she has a wasp-themed armor and wields a wasp stinger as a weapon, similar to Wasp Rick and Wasp Morty. This design choice showcases Summer's transformation into a strong and independent character in the post-apocalyptic wasteland setting."
    },
    {
      "id": 520,
      "name": "Wasp Jerry",
      "about": "Wasp Jerry is an alternate version of Jerry Smith who appears in the episode 'Rickmancing the Stone.' The curious fact about Wasp Jerry is that he wears a wasp-themed armor and carries a stinger as a weapon, similar to the other characters in the wasteland. This design choice emphasizes Jerry's attempt to fit in and be part of the survivalist culture in the post-apocalyptic world of Rick and Morty."
    }
  ]
}
