{
  "list": [
    {
      "id": 521,
      "name": "Wasp Beth",
      "about": "Wasp Beth is an alternate version of Beth Smith who appears in the episode 'Rickmancing the Stone.' The curious fact about Wasp Beth is that she wears a wasp-themed armor and carries a stinger as a weapon, similar to the other characters in the wasteland. This design choice reflects Beth's transformation and adaptation to the harsh and dangerous environment of the post-apocalyptic world."
    },
    {
      "id": 522,
      "name": "Caterpillar Mr. Goldenfold’s Larvae",
      "about": "Caterpillar Mr. Goldenfold's Larvae are the offspring of Caterpillar Mr. Goldenfold in the episode 'Close Rick-counters of the Rick Kind.' The curious fact about these larvae is that they have inherited their parent's caterpillar-like appearance and are often seen smoking tiny cigarettes. This humorous detail adds a whimsical touch to the character and reinforces the surreal and imaginative nature of the Rick and Morty universe."
    },
    {
      "id": 523,
      "name": "Boglin",
      "about": "Boglin is a character who appears in the episode 'The Old Man and the Seat.' The curious fact about Boglin is that he is based on the real-life toy line of the same name. Boglins were popular rubber hand puppets produced in the 1980s and 1990s. The inclusion of Boglin in Rick and Morty serves as a nostalgic reference for fans who grew up with these quirky and interactive toys."
    },
    {
      "id": 524,
      "name": "Kirkland Brand Mr. Meeseeks",
      "about": "Kirkland Brand Mr. Meeseeks is a knockoff version of Mr. Meeseeks that appears in the episode 'Meeseeks and Destroy.' The curious fact about Kirkland Brand Mr. Meeseeks is that his name is a playful reference to Kirkland Signature, a private label brand owned by Costco. This adds a humorous twist to the character, implying that he is a budget-friendly version of the original Mr. Meeseeks."
    },
    {
      "id": 525,
      "name": "Glootie",
      "about": "Glootie is an alien intern who appears in the episode 'Interdimensional Cable 2: Tempting Fate.' The curious fact about Glootie is that he is voiced by Taika Waititi, a renowned filmmaker, actor, and comedian. Taika Waititi is known for his directorial work in films like 'Thor: Ragnarok' and 'Jojo Rabbit' and his acting roles in projects like 'What We Do in the Shadows.' His distinct comedic talent adds a lively and entertaining performance to the character of Glootie in Rick and Morty."
    },
    {
      "id": 526,
      "name": "Danny Publitz",
      "about": "Danny Publitz is a character who appears in the episode 'The Whirly Dirly Conspiracy.' The curious fact about Danny Publitz is that his design and personality are inspired by Jerry Gergich, a character from the TV series 'Parks and Recreation.' Both characters share similar physical appearances and a penchant for unfortunate situations, creating a humorous reference for fans of both shows and adding a touch of comedy to Danny Publitz's character in Rick and Morty."
    },
    {
      "id": 527,
      "name": "Mothership Intern",
      "about": "Mothership Intern is a character who appears in the episode 'Ricksy Business.' The curious fact about Mothership Intern is that he is voiced by Tom Kenny, a prolific voice actor known for his iconic roles, such as SpongeBob SquarePants and the Ice King from 'Adventure Time.' Tom Kenny's versatile voice adds a playful and comedic tone to the character of Mothership Intern in Rick and Morty."
    },
    {
      "id": 528,
      "name": "Monogatron Leader",
      "about": "Monogatron Leader is a character who appears in the episode 'Ricksy Business.' The curious fact about Monogatron Leader is that he is voiced by John DiMaggio, a well-known voice actor in the industry. John DiMaggio has provided voices for various animated characters, including Bender in 'Futurama' and Jake the Dog in 'Adventure Time.' His distinct voice adds a commanding and authoritative presence to the character of Monogatron Leader in Rick and Morty."
    },
    {
      "id": 529,
      "name": "Lizard",
      "about": "Lizard is a character who appears in the episode 'Total Rickall.' The curious fact about Lizard is that he is a reference to the classic arcade game 'Street Fighter.' Lizard's design resembles the character Blanka from the game, with his green scaly skin and wild hair. This homage adds a nostalgic touch for fans of 'Street Fighter' and injects a bit of gaming culture into the Rick and Morty universe."
    },
    {
      "id": 530,
      "name": "Deliverance",
      "about": "Deliverance is a character who appears in the episode 'Auto Erotic Assimilation.' The curious fact about Deliverance is that he is voiced by the acclaimed actor and filmmaker Werner Herzog. Werner Herzog is known for his distinctive voice and his contributions to cinema as a director and actor. His casting adds a unique and captivating performance to the character of Deliverance in Rick and Morty."
    },
    {
      "id": 531,
      "name": "Tony",
      "about": "Tony is a character who appears in the episode 'Mortynight Run.' The curious fact about Tony is that he is based on the character Tony Montana from the film 'Scarface.' Tony's appearance, mannerisms, and catchphrases pay homage to the iconic portrayal of Tony Montana by Al Pacino. This reference adds a touch of gangster culture and creates a recognizable and humorous connection between the worlds of Rick and Morty and 'Scarface.'"
    },
    {
      "id": 532,
      "name": "Tony’s Wife",
      "about": "Tony's Wife is a character who appears in the episode 'Mortynight Run.' The curious fact about Tony's Wife is that she is based on Elvira Hancock, a character from the film 'Scarface.' Elvira Hancock is portrayed by Michelle Pfeiffer in the film. Tony's Wife's appearance and demeanor pay homage to Elvira, creating a connection between the worlds of Rick and Morty and 'Scarface.'"
    },
    {
      "id": 533,
      "name": "Monogatron Queen",
      "about": "Monogatron Queen is a character who appears in the episode 'Ricksy Business.' The curious fact about Monogatron Queen is that she is voiced by Claudia Black, a talented actress known for her roles in science fiction TV shows like 'Farscape' and 'Stargate SG-1.' Claudia Black's distinctive voice adds a regal and commanding presence to the character of Monogatron Queen in Rick and Morty."
    },
    {
      "id": 534,
      "name": "Tony's Dad",
      "about": "Tony's Dad is a character who appears in the episode 'Mortynight Run.' The curious fact about Tony's Dad is that he is voiced by Alan Tudyk, a versatile actor known for his roles in projects like 'Firefly' and 'Rogue One: A Star Wars Story.' Alan Tudyk's talent for voicing unique and eccentric characters adds a comedic touch to the portrayal of Tony's Dad in Rick and Morty."
    },
    {
      "id": 535,
      "name": "Jeff",
      "about": "Jeff is a character who appears in the episode 'The Old Man and the Seat.' The curious fact about Jeff is that he is voiced by Justin Roiland, one of the co-creators and main voice actors of Rick and Morty. Justin Roiland's distinct voice brings a comedic and offbeat energy to the character of Jeff, adding an extra layer of humor to the episode."
    },
    {
      "id": 536,
      "name": "Josiah",
      "about": "Josiah is a character who appears in the episode 'The Old Man and the Seat.' The curious fact about Josiah is that he is voiced by Keith David, a talented actor known for his deep and commanding voice. Keith David has provided his voice to various animated characters, including Goliath in 'Gargoyles' and Dr. Facilier in 'The Princess and the Frog.' His powerful voice adds a sense of authority and presence to the character of Josiah in Rick and Morty."
    },
    {
      "id": 537,
      "name": "Maggie",
      "about": "Maggie is a character who appears in the episode 'The Old Man and the Seat.' The curious fact about Maggie is that she is voiced by Kari Wahlgren, a prolific voice actress known for her work in numerous animated shows and films. Kari Wahlgren's versatile voice brings a distinct personality and energy to the character of Maggie in Rick and Morty."
    },
    {
      "id": 538,
      "name": "Priest Witherspoon",
      "about": "Priest Witherspoon is a character who appears in the episode 'Wedding Squanchers.' The curious fact about Priest Witherspoon is that he is voiced by Tom Kenny, the same voice actor who lends his voice to SpongeBob SquarePants. Tom Kenny's ability to bring life to animated characters with his vocal talents adds a humorous and playful touch to the character of Priest Witherspoon in Rick and Morty."
    },
    {
      "id": 539,
      "name": "Richard",
      "about": "Richard is a character who appears in the episode 'The Old Man and the Seat.' The curious fact about Richard is that he is voiced by Rob Paulsen, a renowned voice actor known for his work in numerous animated series, including 'Animaniacs' and 'Teenage Mutant Ninja Turtles.' Rob Paulsen's versatile voice brings a lively and animated performance to the character of Richard in Rick and Morty."
    },
    {
      "id": 540,
      "name": "Running Bird",
      "about": "Running Bird is a character who appears in the episode 'Promortyus.' The curious fact about Running Bird is that he is a parody of the Road Runner, a classic Looney Tunes character. Running Bird's appearance and fast-paced movements pay homage to the iconic cartoon bird, adding a nostalgic and comedic touch to the character in Rick and Morty."
    }
  ]
}
