{
  "list": [
    {
      "id": 701,
      "name": "Metal Rick",
      "about": "Metal Rick is a reference to the episode 'Rattlestar Ricklactica,' where Rick builds an exoskeleton suit for himself using an advanced metal alloy. The suit grants Rick enhanced strength and durability, allowing him to take on formidable foes. Metal Rick symbolizes Rick's knack for using his intellect to create powerful and innovative technologies."
    },
    {
      "id": 702,
      "name": "Gun Brain Rick",
      "about": "Gun Brain Rick doesn't have a direct reference in the show. However, the name suggests a character who possesses exceptional gunfighting skills and tactical prowess. It implies that Rick has integrated advanced weapons and combat abilities directly into his brain, showcasing his relentless pursuit of adventure and penchant for unconventional solutions."
    },
    {
      "id": 703,
      "name": "Mr. Always Wants to be Hunted",
      "about": "Mr. Always Wants to be Hunted is a character introduced in the episode 'Ricksy Business.' He is a man who constantly craves attention and deliberately puts himself in dangerous situations, hoping to be hunted by dangerous beings. This character highlights the show's satirical take on the human desire for validation and the thrill of being pursued."
    },
    {
      "id": 704,
      "name": "Squid Costume Beth",
      "about": "Squid Costume Beth is a reference to the episode 'The Rickchurian Mortydate.' In that episode, Beth wears a squid-themed costume as part of an interdimensional space prom held on the Citadel of Ricks. The costume serves as a playful representation of Beth's willingness to embrace unconventional experiences and her sense of humor."
    },
    {
      "id": 705,
      "name": "Squid Costume Jerry",
      "about": "Squid Costume Jerry is also from 'The Rickchurian Mortydate' episode. Jerry, like Beth, dons a squid-themed costume for the interdimensional space prom. This choice of attire reflects Jerry's lighthearted nature and willingness to participate in unconventional events, even if he may not fully understand or appreciate their significance."
    },
    {
      "id": 706,
      "name": "Squid Costume Morty",
      "about": "Squid Costume Morty, like his family members in squid costumes, appears in 'The Rickchurian Mortydate' episode. Morty's squid-themed costume represents his ability to adapt to different situations, even when they seem strange or unfamiliar. It showcases Morty's resilience and his willingness to embrace the absurdity of the show's multiverse."
    },
    {
      "id": 707,
      "name": "Squid Costume Rick",
      "about": "Squid Costume Rick, seen in 'The Rickchurian Mortydate' episode, is another member of the Smith family embracing the squid-themed costumes for the interdimensional space prom. The costume humorously contrasts Rick's normally serious and cynical demeanor, highlighting his willingness to engage in unusual and light-hearted activities for the sake of his family."
    },
    {
      "id": 708,
      "name": "Squid Costume Summer",
      "about": "Squid Costume Summer, appearing alongside her family members in 'The Rickchurian Mortydate' episode, wears a squid-themed costume for the interdimensional space prom. The costume reflects Summer's ability to adapt and find enjoyment in unconventional situations, showcasing her adventurous spirit and her bond with her family in their interdimensional escapades."
    },
    {
      "id": 709,
      "name": "Dracula",
      "about": "Dracula is a character introduced in the episode 'Something Ricked This Way Comes.' He is an employee at the cursed store, Needful Things, who is transformed into a vampire. Dracula's inclusion in the show's eclectic cast adds a classic horror element, and his character embodies the show's playful and irreverent take on familiar tropes."
    },
    {
      "id": 710,
      "name": "Steve",
      "about": "Steve is a character who appears in the episode 'Meeseeks and Destroy.' He is a family friend of the Smiths, and his main role is to serve as a target for the Meeseeks, creatures that exist solely to fulfill tasks. Steve's presence adds a comedic touch to the episode and highlights the absurd and unpredictable nature of the show."
    },
    {
      "id": 711,
      "name": "When Wolf",
      "about": "When Wolf is a character introduced in the episode 'Ricksy Business.' He is an anthropomorphic wolf who attends the house party held by Rick and Morty. When Wolf's inclusion in the episode is a whimsical and unexpected element, showcasing the show's inclination for imaginative and diverse characters, no matter how peculiar or outlandish they may be."
    },
    {
      "id": 712,
      "name": "Too Cute to Murder Beth",
      "about": "Too Cute to Murder Beth is a reference to the episode 'The ABC's of Beth.' In that episode, Beth's alter ego, 'Grown-up Beth,' creates a safe and adorable world called 'Froopyland' where she indulges in her murderous impulses. This dark and unexpected aspect of Beth's character adds depth and complexity to her role in the show."
    },
    {
      "id": 713,
      "name": "Too Cute to Murder Rick",
      "about": "Too Cute to Murder Rick is another reference to 'The ABC's of Beth' episode. In this alternate world, Rick is known as 'Grown-up Rick' and aids Beth in creating Froopyland. The name 'Too Cute to Murder' humorously contrasts Rick's typically ruthless and cunning nature, highlighting the show's penchant for subverting expectations."
    },
    {
      "id": 714,
      "name": "Too Cute to Murder Jerry",
      "about": "Too Cute to Murder Jerry, featured in 'The ABC's of Beth' episode, is the alternate version of Jerry in Froopyland. In this reality, Jerry serves as Beth's loyal husband and is seemingly incapable of causing harm. The name emphasizes the ironic and unexpected nature of Jerry's character, providing a twist on his usual bumbling and naive persona."
    },
    {
      "id": 715,
      "name": "Too Cute to Murder Morty",
      "about": "Too Cute to Murder Morty, originating from 'The ABC's of Beth' episode, represents Morty in the Froopyland alternate reality. Here, Morty is portrayed as an innocent and cheerful character, incapable of violence. The name 'Too Cute to Murder' contrasts Morty's usual exposure to the dark and dangerous aspects of the show, adding a layer of irony."
    },
    {
      "id": 716,
      "name": "Too Cute to Murder Summer",
      "about": "Too Cute to Murder Summer, also featured in 'The ABC's of Beth' episode, embodies Summer in Froopyland. In this world, Summer takes on a childlike innocence and is shielded from the harsh realities she often faces in the show. The name 'Too Cute to Murder' emphasizes the stark contrast between her Froopyland persona and her usual role."
    },
    {
      "id": 717,
      "name": "Planetina",
      "about": "Planetina is a character introduced in the episode 'Gotron Jerrysis Rickvangelion.' She is an eco-terrorist superhero who forms a romantic connection with Rick. Planetina's character satirizes environmental activism and superhero tropes, serving as a commentary on the complexities of morality and the blurred lines between heroism and extremism."
    },
    {
      "id": 718,
      "name": "Daphne",
      "about": "Daphne is a character who appears in the episode 'Ricksy Business.' She is a member of Birdperson's entourage, attending Rick and Morty's house party. Daphne's inclusion showcases the show's penchant for creating a rich and diverse universe, filled with intriguing and varied characters, even in minor roles."
    },
    {
      "id": 719,
      "name": "Diesel Weasel",
      "about": "Diesel Weasel is a character who appears in the episode 'Something Ricked This Way Comes.' He is an employee at the cursed store, Needful Things, and transforms into a weasel-like creature due to the store's magical items. Diesel Weasel's presence adds an element of chaos and absurdity, contributing to the show's darkly comedic tone."
    },
    {
      "id": 720,
      "name": "Eddie",
      "about": "Eddie is a character who appears in the episode 'Meeseeks and Destroy.' He is a friend of the Smith family, attending the family's barbeque. Eddie's role is relatively minor, showcasing the show's attention to detail by including various background characters to create a vibrant and dynamic world that feels lived-in."
    }
  ]
}
