{
  "list": [
    {
      "id": 781,
      "name": "Rick's Garage",
      "about": "Rick's Garage is a recurring location in the series, serving as Rick's laboratory and workspace. It is filled with various inventions, gadgets, and scientific equipment. The garage represents Rick's chaotic genius and his desire for independence, as he prefers working on his experiments away from societal norms and regulations."
    },
    {
      "id": 782,
      "name": "Memory Squanchy",
      "about": "Memory Squanchy is a character from the episode 'Rattlestar Ricklactica.' He is a memory construct of Squanchy, a cat-like creature who often uses the word 'Squanch' in his speech. Memory Squanchy serves as a reminder of the eccentric and sometimes incomprehensible language and behavior of the characters in the show."
    },
    {
      "id": 783,
      "name": "Memory Rick",
      "about": "Memory Rick is a character from the episode 'Rattlestar Ricklactica.' He is a memory construct of Rick Sanchez, representing his past experiences and inner thoughts. This character reflects the multi-layered nature of Rick's personality and the complexity of his memories and emotions."
    },
    {
      "id": 784,
      "name": "Memory Rick",
      "about": "Memory Rick is a character from the episode 'Rattlestar Ricklactica.' He is a memory construct of Rick Sanchez, representing his past experiences and inner thoughts. This character reflects the multi-layered nature of Rick's personality and the complexity of his memories and emotions."
    },
    {
      "id": 785,
      "name": "Memory Geardude",
      "about": "Memory Geardude is a character from the episode 'Rattlestar Ricklactica.' He is a memory construct of a robot character named Gearhead. Memory Geardude represents the technologically advanced and mechanical aspects of the show, highlighting the fusion of futuristic elements and humor within the Rick and Morty universe."
    },
    {
      "id": 786,
      "name": "Birdperson & Tammy's Child",
      "about": "Birdperson and Tammy's Child is a character introduced in the episode 'Star Mort: Rickturn of the Jerri.' The child is the result of the relationship between Birdperson and Tammy, who was revealed to be an undercover agent. This character signifies the consequences and lasting effects of past choices and relationships in the show."
    },
    {
      "id": 787,
      "name": "Two Crows",
      "about": "Two Crows is a pair of crows featured in the episode 'A Rickle in Time.' They serve as a comedic element, providing commentary on the time fractures caused by Rick's experiment. The crows' repeated observations and banter add a lighthearted touch to the complex concept of time manipulation in the episode."
    },
    {
      "id": 788,
      "name": "Mr. Cookie President",
      "about": "Mr. Cookie President is a character from the episode 'Big Trouble in Little Sanchez.' He is a sentient cookie who becomes the president of a microscopic society within Rick's body. This character showcases the imaginative and whimsical nature of the show, as even inanimate objects can hold positions of power and significance."
    },
    {
      "id": 789,
      "name": "Nick",
      "about": "Nick is a character from the episode 'Anatomy Park.' He is a homeless man who volunteers to enter the theme park built inside a human body. Nick's character represents the unpredictable and often morally ambiguous individuals who are drawn into Rick and Morty's adventures."
    },
    {
      "id": 790,
      "name": "Harold (Garbage Goober)",
      "about": "Harold, also known as Garbage Goober, is a character from the episode 'One Crew Over the Crewcoo's Morty.' He is a sentient pile of garbage who becomes a member of Rick's heist crew. Harold's character highlights the show's ability to turn seemingly mundane or unappealing objects into unique and unexpected personalities."
    },
    {
      "id": 791,
      "name": "Harold's Wife",
      "about": "Harold's wife, despite being mentioned multiple times throughout the series, never actually appears in any episode of Rick and Morty. She remains a mysterious character, known only through her occasional mentions by Harold and other characters in the show."
    },
    {
      "id": 792,
      "name": "Alien Crow",
      "about": "The Alien Crow is based on the character from the movie 'The Crow,' played by Brandon Lee. The movie is known for its tragic production, as Brandon Lee, the son of martial arts legend Bruce Lee, died during the filming of a scene due to a firearms accident. The Alien Crow in Rick and Morty is a tribute to Brandon Lee's iconic role."
    },
    {
      "id": 793,
      "name": "Alien Crow",
      "about": "The Alien Crow is voiced by Keith David, who is known for his deep and distinctive voice. Keith David has also lent his voice to other popular characters, such as Goliath in 'Gargoyles' and the Arbiter in the 'Halo' video game series. His powerful voice adds an extra layer of gravitas to the character of the Alien Crow."
    },
    {
      "id": 794,
      "name": "Samansky",
      "about": "Samansky is a reference to the character 'Uncle Leo' from the sitcom 'Seinfeld.' In 'Seinfeld,' Uncle Leo, played by Len Lesser, is known for his catchphrase 'Hello!' and his exaggerated eyebrows. Similarly, Samansky in Rick and Morty has distinctive eyebrows and a memorable catchphrase, 'Ohh-wee!' The character pays homage to the iconic role in 'Seinfeld.'"
    },
    {
      "id": 795,
      "name": "Palicki",
      "about": "Palicki is named after the actress Adrianne Palicki, who is known for her roles in various TV shows and movies. She gained significant recognition for her portrayal of Bobbi Morse/Mockingbird in the Marvel's 'Agents of S.H.I.E.L.D.' TV series. The character Palicki in Rick and Morty is a nod to the talented actress and her contributions to the entertainment industry."
    },
    {
      "id": 796,
      "name": "Sarge",
      "about": "Sarge, a character in Rick and Morty, shares his name with a Marvel Comics character. In Marvel, Sarge is a member of the Howling Commandos and often fights alongside Captain America during World War II. While the Rick and Morty character Sarge is not directly related to the Marvel counterpart, the shared name could be a subtle homage to the comic book character."
    },
    {
      "id": 797,
      "name": "Slartivartian",
      "about": "Slartivartian is a play on the name 'Slartibartfast,' a character from Douglas Adams' 'The Hitchhiker's Guide to the Galaxy' series. In the book, Slartibartfast is a planetary engineer who is responsible for the design of Earth's fjords. The name 'Slartivartian' in Rick and Morty is likely a humorous reference to this iconic character in science fiction literature."
    },
    {
      "id": 798,
      "name": "Ferkusian",
      "about": "Ferkusian is a reference to the planet Ferkus 9, which is mentioned in the episode 'The Ricks Must Be Crazy' of Rick and Morty. In the episode, Ferkus 9 is described as a planet with bumpy landscapes and aggressive inhabitants. The name 'Ferkusian' serves as a connection to the peculiarities and adventures associated with the planet mentioned in the series."
    },
    {
      "id": 799,
      "name": "Morglutzian",
      "about": "Morglutzian is a nod to the episode 'Morty's Mind Blowers' in Rick and Morty, where Morty's memories are revealed to be stored in various colored vials. The name 'Morglutzian' could be interpreted as an amalgamation of different memories and experiences, just like the collection of mind-blowing moments depicted in the episode. It symbolizes the chaotic and unpredictable nature of Morty's adventures."
    },
    {
      "id": 800,
      "name": "Super Turkey",
      "about": "Super Turkey is a fictional character that first appears in the episode 'The Rickchurian Mortydate' of Rick and Morty. Super Turkey is a superhero-like figure who fights against President Morty's regime. The concept of Super Turkey is a humorous parody of superhero tropes, showcasing the absurdity and satirical nature of the show's take on popular culture and politics."
    }
  ]
}
