{
  "list": [
    {
      "id": 101,
      "name": "E. Coli",
      "about": "about: In the episode 'Anatomy Park,' E. Coli is portrayed as a microscopic character living inside a human body-themed amusement park. This character is a parody of the real-life bacterium Escherichia coli, which is commonly found in the intestines of humans and other animals. Unlike its animated counterpart, real E. coli bacteria can have both beneficial and harmful effects on the human body."
    },
    {
      "id": 102,
      "name": "Donna Gueterman",
      "about": "about: Donna Gueterman, although a minor character, plays a crucial role in the episode 'Meeseeks and Destroy.' She seeks help from Rick and Morty to fix her golf swing. Interestingly, her character design and mannerisms are inspired by professional golfer Tiger Woods. The creators of Rick and Morty are known for including subtle references and parodies of various pop culture figures and events throughout the series."
    },
    {
      "id": 103,
      "name": "Doofus Rick",
      "about": "about: Doofus Rick, also known as 'Simple Rick,' is a unique character in the multiverse of Ricks. Unlike other versions of Rick, he is notably kind-hearted and lacks the typical intelligence and cynicism associated with Ricks. In the episode 'Tales from the Citadel,' Doofus Rick is shown making 'Simple Rick's Simple Wafer Cookies.' The jingle used in the commercial for these cookies, 'Come home to the impossible flavor of your own completion,' has become a memorable catchphrase from the series."
    },
    {
      "id": 104,
      "name": "Doom-Nomitron",
      "about": "about: Doom-Nomitron is a giant robotic monster that appears in the episode 'Something Ricked This Way Comes.' It was created by the devilish character known as Mr. Needful, who runs an antique shop called 'Curios Rick's.' The name 'Doom-Nomitron' is a play on the word 'dominator' and references the destructive nature of the robot. This character and episode satirize the concept of making deals with the devil and the consequences that come with it."
    },
    {
      "id": 105,
      "name": "Dr. Glip-Glop",
      "about": "about: Dr. Glip-Glop is a fictional character created by Morty in the episode 'Rixty Minutes.' The phrase 'Glip-Glop' is a derogatory term used by Rick to mock the alien characters on interdimensional television. However, when Morty uses it as a character name, it unintentionally gains popularity among the inhabitants of an alien planet. This highlights the unpredictable and often absurd nature of the Rick and Morty universe, where even made-up words can have significant consequences."
    },
    {
      "id": 106,
      "name": "Dr. Schmidt",
      "about": "about: Dr. Schmidt is a character who appears in the episode 'Auto Erotic Assimilation.' He is a former colleague of Rick and is known for his involvement in genetic experiments. The character design and personality of Dr. Schmidt are inspired by real-life German geneticist Dr. Josef Mengele, who conducted unethical and inhumane experiments during World War II. Rick and Morty often draw inspiration from historical figures to create morally ambiguous and controversial characters."
    },
    {
      "id": 107,
      "name": "Dr. Wong",
      "about": "about: Dr. Wong is a family therapist who appears in the episode 'Pickle Rick.' She provides counseling to the Smith family, including Rick, Morty, and Summer. Dr. Wong's character is notable for her insightful and no-nonsense approach to therapy, which contrasts with the chaotic and unpredictable nature of the show. Her character resonated with viewers, highlighting the importance of mental health and emotional well-being even in the midst of interdimensional adventures."
    },
    {
      "id": 108,
      "name": "Dr. Xenon Bloom",
      "about": "about: Dr. Xenon Bloom is a character introduced in the episode 'The Ricks Must Be Crazy.' He is the director of Anatomy Park, an amusement park built inside a human body. Dr. Bloom's design and voice are based on the iconic actor Richard Attenborough, known for his role as John Hammond in 'Jurassic Park.' This is yet another example of the series paying homage to pop culture, blending it with its unique and often bizarre storytelling."
    },
    {
      "id": 109,
      "name": "Duck With Muscles",
      "about": "about: Duck With Muscles is a minor character that appears in the episode 'The Rickshank Rickdemption.' He is a muscular duck wearing an exosuit and is briefly shown during a scene set in a post-apocalyptic dimension. This character is a parody of the film 'Dude with Muscles,' which itself is a spoof of the movie 'Dude, Where's My Car?' The inclusion of such random and humorous characters is a trademark of Rick and Morty's offbeat humor."
    },
    {
      "id": 110,
      "name": "Eli",
      "about": "about: Eli is a character who appears in the episode 'Raising Gazorpazorp.' He is a native of the planet Gazorpazorp and claims to be Morty's son. Interestingly, Eli was voiced by actor Justin Roiland, who also provides the voices for both Rick and Morty. This demonstrates Roiland's versatility as a voice actor and his ability to bring distinct personalities to life. The complexity of the characters in Rick and Morty often leads to surprising connections and revelations."
    },
    {
      "id": 111,
      "name": "Eli's Girlfriend",
      "about": "about: Eli's Girlfriend, also known as 'Tricia Lange,' is a character introduced in the episode 'Raising Gazorpazorp.' She is initially depicted as a promiscuous and shallow character but later reveals herself to be more complex. Tricia Lange's character design and personality are influenced by the 1987 film 'RoboCop,' particularly the character of Anne Lewis. This blending of references and parody is a recurring theme in the world of Rick and Morty."
    },
    {
      "id": 112,
      "name": "Eric McMan",
      "about": "about: Eric McMan is a character who appears in the episode 'The Rickshank Rickdemption.' He is one of the Galactic Federation agents involved in interrogating Rick. Eric McMan's character design and demeanor bear a striking resemblance to the iconic actor and comedian Eric Andre, known for his surreal and unpredictable style. This casting choice adds an extra layer of humor and absurdity to the episode, enhancing the overall Rick and Morty experience."
    },
    {
      "id": 113,
      "name": "Eric Stoltz Mask Morty",
      "about": "about: Eric Stoltz Mask Morty is a Morty variant that appears in the episode 'Mortynight Run.' This Morty is seen wearing a mask resembling the face of actor Eric Stoltz in the film 'Mask.' The inclusion of this character is a clever play on words, blending the concept of Morty wearing a mask with the name 'Eric Stoltz Mask Morty.' It is another example of the series' attention to detail and its knack for combining pop culture references in unexpected ways."
    },
    {
      "id": 114,
      "name": "Ethan",
      "about": "about: Ethan is a character who appears in the episode 'Something Ricked This Way Comes.' He is Summer's on-again, off-again boyfriend, and their relationship becomes strained when Summer gains super strength. Interestingly, Ethan's character design and personality are heavily influenced by the 'Twilight' series, particularly the character Jacob Black. This parody highlights the show's tendency to satirize popular media and explore teenage relationships in a humorous and exaggerated manner."
    },
    {
      "id": 115,
      "name": "Ethan",
      "about": "about: Ethan is a character who appears in the episode 'Anatomy Park.' He is Summer's classmate and is invited to join Rick and Morty inside the body-themed amusement park. Ethan's character undergoes a drastic transformation during the episode when he encounters various dangerous creatures within the park. This transformation serves as a metaphor for the challenges and growth that teenagers often experience while navigating relationships and the complexities of adulthood."
    },
    {
      "id": 116,
      "name": "Evil Beth Clone",
      "about": "about: The Evil Beth Clone is a clone of Beth Smith created by Rick in the episode 'The ABC's of Beth.' The clone is designed to be more ruthless and cold-hearted than the original Beth. However, the true identity of the Evil Beth Clone is intentionally left ambiguous, leaving viewers to speculate whether she is the real Beth or the clone. This uncertainty adds a layer of philosophical and existential contemplation to the already intricate narrative of the series."
    },
    {
      "id": 117,
      "name": "Evil Jerry Clone",
      "about": "about: The Evil Jerry Clone is a clone of Jerry Smith created by Rick in the episode 'Meeseeks and Destroy.' The clone is initially intended to assist Jerry with his golf game but ends up causing chaos and destruction. The concept of creating clones for specific purposes is a recurring theme in Rick and Morty, exploring the moral and ethical implications of playing with life and identity. The Evil Jerry Clone serves as a cautionary example of the unintended consequences that can arise from such experiments."
    },
    {
      "id": 118,
      "name": "Evil Morty",
      "about": "about: Evil Morty is a character that first appears in the episode 'Close Rick-Counters of the Rick Kind.' He is a version of Morty who has become disillusioned with Ricks and seeks to overthrow the Council of Ricks. Evil Morty's character has gained a significant following among fans due to his enigmatic nature and mysterious backstory. His theme music, a remixed version of the song 'For the Damaged Coda' by Blonde Redhead, has become iconic and synonymous with his character."
    },
    {
      "id": 119,
      "name": "Evil Rick",
      "about": "about: Evil Rick, also known as 'Rick Sanchez' or 'Eyepatch Rick,' is a character introduced in the episode 'Close Rick-Counters of the Rick Kind.' He is revealed to be a robot controlled by Evil Morty, serving as a decoy to frame other Ricks. Evil Rick's design and demeanor are reminiscent of classic sci-fi villains, adding a layer of intrigue and suspense to his role in the series. The dynamic between Evil Rick and Evil Morty explores themes of manipulation and betrayal within the multiverse."
    },
    {
      "id": 120,
      "name": "Evil Summer Clone",
      "about": "about: The Evil Summer Clone is a clone of Summer Smith created by Rick in the episode 'Close Rick-Counters of the Rick Kind.' Like the Evil Morty and Evil Jerry Clone, the Evil Summer Clone is part of a larger plot orchestrated by Evil Morty. The clone is depicted as ruthless and efficient, reflecting the darker side of Summer's character. This exploration of duality and the potential for darkness within seemingly ordinary characters is a recurring theme in Rick and Morty."
    }
  ]
}
