{
  "list": [
    {
      "id": 121,
      "name": "Eyehole Man",
      "about": "The Eyehole Man is a character from a popular commercial in the Rick and Morty universe. The character wears a trench coat and constantly seeks to protect his eyehole cereal from others. In the show, the Eyehole Man has become a cult figure, and his catchphrase 'I'm the Eyehole Man, I'm the only one that's allowed to have eye holes!' has gained significant popularity."
    },
    {
      "id": 122,
      "name": "Fart",
      "about": "Fart is a telepathic gas cloud from an episode titled 'Mortynight Run.' Fart has the ability to communicate with various species through telepathy and possesses a deep understanding of the universe. Interestingly, Fart is voiced by Jermaine Clement, a New Zealand actor, comedian, and musician known for his work in the comedy duo Flight of the Conchords."
    },
    {
      "id": 123,
      "name": "Fat Morty",
      "about": "Fat Morty is an alternate version of Morty Smith from a reality where he gained a significant amount of weight. This version of Morty is seen briefly in the episode 'Close Rick-counters of the Rick Kind.' Fat Morty's appearance is a satirical take on the stereotypical overweight and lazy teenager often portrayed in various media."
    },
    {
      "id": 124,
      "name": "Father Bob",
      "about": "Father Bob is a character who appears in the episode 'The Rickshank Rickdemption.' He is a religious figure who works as a priest in the Citadel of Ricks. Father Bob is known for his welcoming nature and his willingness to listen to the problems and confessions of the residents of the Citadel."
    },
    {
      "id": 125,
      "name": "Flansian",
      "about": "Flansians are a species introduced in the episode 'The ABC's of Beth.' They are small, humanoid creatures with colorful skin and communicate through musical tones. Flansians have the ability to generate portals, which they use for various purposes, including interdimensional travel. They play a minor role in the episode, aiding Beth in her journey."
    },
    {
      "id": 126,
      "name": "Fleeb",
      "about": "Fleeb is a fictional creature mentioned in the Rick and Morty universe. In the episode 'The Ricks Must Be Crazy,' Rick refers to 'fleeb juice,' which is a key ingredient for creating concentrated dark matter. Although the physical appearance of a fleeb is unknown, it is implied to be a living organism that produces the valuable substance."
    },
    {
      "id": 127,
      "name": "Frank Palicky",
      "about": "Frank Palicky is a character who appears in the episode 'Anatomy Park.' He is the late husband of Annie, a member of the Anatomy Park security team. Frank was originally a homeless man whom Dr. Xenon Bloom saved and transformed into a microscopic theme park ride operator. Unfortunately, Frank died when the Anatomy Park was destroyed by antibodies."
    },
    {
      "id": 128,
      "name": "Frankenstein's Monster",
      "about": "Frankenstein's Monster, also known as Frankenstein, makes a brief appearance in the episode 'The Ricklantis Mixup' (renamed 'Tales From the Citadel' for the DVD release). In this episode, a version of Frankenstein's Monster can be seen in the background during the scenes set in the Citadel of Ricks. It's just one of the many interesting and bizarre characters that populate the Citadel."
    },
    {
      "id": 129,
      "name": "Fulgora",
      "about": "Fulgora is an insect-like alien creature seen in the episode 'Raising Gazorpazorp.' The species is native to the planet Gazorpazorp and is known for its aggressive behavior. Fulgorans have a unique reproductive cycle, where males are born through violent means, causing the death of the female parent. They play a significant role in the episode's plot, with one Fulgoran named Morty Jr. becoming a central character."
    },
    {
      "id": 130,
      "name": "Galactic Federation President",
      "about": "The Galactic Federation President is a character who plays a crucial role in the Rick and Morty episode 'The Rickshank Rickdemption.' The President holds a position of power in the intergalactic government and becomes Rick's antagonist in this episode. Interestingly, the President is voiced by actor Keith David, known for his distinctive voice and roles in various films and TV shows."
    },
    {
      "id": 131,
      "name": "Gar Gloonch",
      "about": "Gar Gloonch is a character mentioned in the episode 'The Ricklantis Mixup' (renamed 'Tales From the Citadel' for the DVD release). Gar Gloonch is a musical artist who has a hit song titled 'Get Schwifty.' The character is not shown on screen, but the song becomes a popular phenomenon in the Rick and Morty universe, with its catchy tune and unusual lyrics."
    },
    {
      "id": 132,
      "name": "Gar's Mytholog",
      "about": "Gar's Mytholog is a character introduced in the episode 'Rixty Minutes.' It is a giant creature that represents the personification of Gar's insecurities and flaws. The Mytholog possesses the ability to manifest physical forms of these flaws, creating an interesting visual representation of the character's internal struggles. The concept of Mythologs provides an introspective look into the psychology of the show's characters."
    },
    {
      "id": 133,
      "name": "Garblovian",
      "about": "Garblovians are an alien species mentioned in the Rick and Morty universe. In the episode 'Close Rick-counters of the Rick Kind,' Rick uses the term 'Garblovian ham' as a secret password to access a hidden lair. The specifics of Garblovians and their culture are not explored in the series, but the mention of the species adds to the world-building and humor of the show."
    },
    {
      "id": 134,
      "name": "Garmanarnar",
      "about": "Garmanarnar is a character mentioned in the episode 'The Wedding Squanchers.' The character is part of the Squanchy species, known for their eccentric behavior and the catchphrase 'Squanch.' Garmanarnar is referred to as the 'bridesmaid Squanchy,' indicating a connection to the events of the episode, which revolve around Birdperson and Tammy's wedding."
    },
    {
      "id": 135,
      "name": "Garment District Rick",
      "about": "Garment District Rick is a version of Rick from the episode 'The Ricklantis Mixup' (renamed 'Tales From the Citadel' for the DVD release). This Rick runs a shop in the Citadel of Ricks that sells different clothing items. Garment District Rick is known for his distinctive personality and accent, adding to the diverse array of Ricks depicted in the episode."
    },
    {
      "id": 136,
      "name": "Gazorpazorpfield",
      "about": "Gazorpazorpfield is a fictional TV show within the Rick and Morty universe. It is a parody of the comic strip character Garfield. Gazorpazorpfield is a crude and violent version of the original character, often engaging in dark and disturbing activities. The show is a recurring element in the series and serves as a commentary on the nature of popular media and its impact on society."
    },
    {
      "id": 137,
      "name": "Gene",
      "about": "Gene is a character who appears in the episode 'The Ricklantis Mixup' (renamed 'Tales From the Citadel' for the DVD release). He is a factory worker in the Citadel of Ricks and is shown working on assembly lines, producing various items. Gene's character highlights the theme of individuality and conformity in the Citadel, as he seeks to break free from the monotonous routine of his job."
    },
    {
      "id": 138,
      "name": "General Nathan",
      "about": "General Nathan is a high-ranking military officer who appears in the episode 'Get Schwifty.' He represents the U.S. military and is involved in the government's response to the giant head that appears in the sky, demanding a hit song. General Nathan is depicted as a no-nonsense military leader, adding a satirical element to the portrayal of military figures in the show."
    },
    {
      "id": 139,
      "name": "General Store Owner",
      "about": "The General Store Owner is a character seen in the episode 'The Rickshank Rickdemption.' He is the proprietor of a general store in the Citadel of Ricks and provides supplies and items to the residents. The General Store Owner showcases the mundane aspects of life within the Citadel, contrasting with the grander themes and conflicts explored in the series."
    },
    {
      "id": 140,
      "name": "Genital Washer",
      "about": "The Genital Washer is a character mentioned in the episode 'Interdimensional Cable 2: Tempting Fate.' The name implies that the character is involved in the personal hygiene and care of genitalia. The reference to the Genital Washer adds to the absurd and often explicit humor found in the interdimensional cable episodes of Rick and Morty."
    }
  ]
}
