{
  "list": [
    {
      "id": 141,
      "name": "Ghost in a Jar",
      "about": "The Ghost in a Jar is an item that appears in the episode 'Something Ricked This Way Comes.' It is a jar containing a ghostly entity, which is sold by the antique shop owner, Mr. Needful. The Ghost in a Jar plays a minor role in the episode's plot, serving as a macabre and supernatural item that piques Morty's curiosity."
    },
    {
      "id": 142,
      "name": "Gibble Snake",
      "about": "The Gibble Snake is a creature mentioned in the Rick and Morty episode 'Rixty Minutes.' It is a fictional animal that Rick claims has the ability to gobble up every third Smidgen in the universe. The Gibble Snake serves as a comedic reference to the bizarre and nonsensical creatures often encountered in the show."
    },
    {
      "id": 143,
      "name": "Glasses Morty",
      "about": "Glasses Morty is an alternate version of Morty Smith who wears glasses. He appears briefly in the episode 'Close Rick-counters of the Rick Kind' and is seen among the various Mortys captured by the Council of Ricks. Glasses Morty's appearance is a simple variation on the original Morty design, highlighting the infinite possibilities of alternate realities."
    },
    {
      "id": 144,
      "name": "Glenn",
      "about": "Glenn is a character who appears in the episode 'The Ricklantis Mixup' (renamed 'Tales From the Citadel' for the DVD release). He is a politician campaigning to become the new president of the Citadel of Ricks. Glenn represents the ambitious and sometimes corrupt nature of politics, showcasing the complexities of governance even within the Citadel."
    },
    {
      "id": 145,
      "name": "Glenn",
      "about": "Glenn is a character who appears in the episode 'The Ricklantis Mixup' (renamed 'Tales From the Citadel' for the DVD release). He is a politician campaigning to become the new president of the Citadel of Ricks. Glenn represents the ambitious and sometimes corrupt nature of politics, showcasing the complexities of governance even within the Citadel."
    },
    {
      "id": 146,
      "name": "Glexo Slim Slom",
      "about": "Glexo Slim Slom is a character who appears in the episode 'The Ricklantis Mixup' (renamed 'Tales From the Citadel' for the DVD release). He is a slimy creature working at a casino in the Citadel of Ricks. Glexo Slim Slom's appearance and job reflect the diversity of beings and professions within the Citadel, adding to the world-building of the show."
    },
    {
      "id": 147,
      "name": "Gobo",
      "about": "Gobo is a character mentioned in the episode 'The Ricklantis Mixup' (renamed 'Tales From the Citadel' for the DVD release). Gobo is known for owning a shrimp stand in the Citadel of Ricks, specializing in shrimp-related delicacies. While not seen on screen, Gobo's mention adds to the rich tapestry of characters and businesses within the Citadel."
    },
    {
      "id": 148,
      "name": "Goddess Beth",
      "about": "Goddess Beth is a character who appears in the episode 'The Ricklantis Mixup' (renamed 'Tales From the Citadel' for the DVD release). She is an alternate version of Beth Smith, depicted as a powerful deity worshipped by a religious cult in the Citadel of Ricks. The concept of Goddess Beth explores the themes of power, faith, and the role of deities within different societies."
    },
    {
      "id": 149,
      "name": "Gordon Lunas",
      "about": "Gordon Lunas is a character who appears in the episode 'The Ricklantis Mixup' (renamed 'Tales From the Citadel' for the DVD release). He is a news anchor in the Citadel of Ricks and is shown reporting on various events happening within the Citadel. Gordon Lunas represents the media and its role in shaping public perception and disseminating information within the Citadel."
    },
    {
      "id": 150,
      "name": "Cornvelious Daniel",
      "about": "Cornvelious Daniel is an interdimensional customs agent who appears in the episode 'The Rickshank Rickdemption.' He interrogates Rick using a brainalyzer to extract information. Interestingly, Cornvelious Daniel is voiced by actor Nathan Fillion, known for his roles in popular TV shows like 'Firefly' and 'Castle.' Fillion's distinct voice adds to the memorable portrayal of this character."
    },
    {
      "id": 151,
      "name": "Gwendolyn",
      "about": "In the Rick and Morty series, Gwendolyn is a character who appears in the episode 'The ABC's of Beth.' She is a young girl who becomes friends with Tommy, the imaginary friend of Beth Smith. Gwendolyn has the ability to shoot lasers from her eyes, making her a formidable ally in their adventures."
    },
    {
      "id": 152,
      "name": "Hammerhead Morty",
      "about": "Hammerhead Morty is a unique Morty variant in the Rick and Morty series. He possesses the characteristics of a hammerhead shark, including his distinct head shape and fins. Despite his unusual appearance, Hammerhead Morty is just as capable and resourceful as any other Morty, often proving himself in battles against other Mortys in the series."
    },
    {
      "id": 153,
      "name": "Hamster In Butt",
      "about": "Hamster In Butt is a character briefly mentioned in the Rick and Morty episode 'Total Rickall.' The episode features a parasitic alien species that implants false memories into people's minds, causing them to believe that the parasites are long-lost family members and friends. While Hamster In Butt is not shown on-screen, the mere mention of this absurd character adds to the comedic and bizarre nature of the episode."
    },
    {
      "id": 154,
      "name": "Hamurai",
      "about": "Hamurai is a character in the Rick and Morty multiverse who appears in the episode 'Close Rick-counters of the Rick Kind.' As the name suggests, Hamurai is a fusion of a hamster and a samurai. This peculiar combination results in a tiny but skilled warrior who wields a tiny sword. Hamurai showcases the series' creativity and penchant for blending unexpected elements to create unique and memorable characters."
    },
    {
      "id": 155,
      "name": "Harold",
      "about": "Harold is a character who appears in the episode 'Get Schwifty' in Rick and Morty. He is an ordinary civilian who is chosen as one of the backup singers for the song 'Get Schwifty' performed by Rick and Morty. Harold's brief moment in the spotlight highlights the show's satirical take on celebrity culture and the randomness of fame and fortune."
    },
    {
      "id": 156,
      "name": "Hemorrhage",
      "about": "Hemorrhage, also known as 'The Alpha Leader,' is the leader of a post-apocalyptic faction called The Death Stalkers in the Rick and Morty episode 'Rickmancing the Stone.' Hemorrhage is a fearsome warrior who wields a deadly weapon called the Blood Dome. His character parodies the archetypal post-apocalyptic warlord, showcasing the series' knack for subverting and satirizing genre conventions."
    },
    {
      "id": 157,
      "name": "Hole in the Wall Where the Men Can See it All",
      "about": "Hole in the Wall Where the Men Can See it All is a location that appears in the Rick and Morty episode 'Interdimensional Cable 2: Tempting Fate.' It is a literal hole in a wall that allows people to observe various scenes, including one where a gazorpian woman is taking a shower. The name of this location is a tongue-in-cheek reference to peepholes and voyeurism, reflecting the show's penchant for absurd and risqué humor."
    },
    {
      "id": 158,
      "name": "Hookah Alien",
      "about": "The Hookah Alien is a character introduced in the Rick and Morty episode 'Ricksy Business.' This alien is seen enjoying a hookah and appears to be relaxed and laid-back. The inclusion of this character is a nod to the show's tendency to populate its universe with a wide variety of unique and diverse extraterrestrial beings, each with their own quirks and characteristics."
    },
    {
      "id": 159,
      "name": "Hunter",
      "about": "Hunter is a character who appears in the episode 'Raising Gazorpazorp' in Rick and Morty. He is a member of the Gazorpian tribe, a society dominated by female Gazorpazorpians. Hunter provides an interesting contrast to the predominantly female society, offering insights into the dynamics and complexities of gender roles and expectations explored in the series."
    },
    {
      "id": 160,
      "name": "Hunter's Father",
      "about": "Hunter's Father is mentioned in the Rick and Morty episode 'Raising Gazorpazorp.' While he does not make a physical appearance in the episode, the mention of Hunter's Father adds depth to the Gazorpian society and hints at the presence of male Gazorpazorpians. This subtle detail showcases the show's world-building and attention to even minor characters and their relationships."
    }
  ]
}
